In [3]:
import pandas as pd
df=pd.read_csv(r"C:\Users\yvsur\Downloads\temp.csv")
df

        city  humidity  temperature
0  Hyderabad      25.0         65.0
1  Hyderabad       NaN         22.0
2  Hyderabad      45.0          NaN
3   kakinada      32.0         12.0
4   kakinada       NaN         65.0
5   kakinada      66.0          NaN
6    chennai      31.0         34.0
7      vizag      56.0         77.0
8      vizag      12.0         23.0
9   banglore      34.0         11.0

In [4]:
df.isnull()

    city  humidity  temperature
0  False     False        False
1  False      True        False
2  False     False         True
3  False     False        False
4  False      True        False
5  False     False         True
6  False     False        False
7  False     False        False
8  False     False        False
9  False     False        False

In [5]:
df.isnull().sum()

city           0
humidity       2
temperature    2
dtype: int64

In [6]:
df_clean=df.dropna()

In [7]:
df_clean

        city  humidity  temperature
0  Hyderabad      25.0         65.0
3   kakinada      32.0         12.0
6    chennai      31.0         34.0
7      vizag      56.0         77.0
8      vizag      12.0         23.0
9   banglore      34.0         11.0

In [8]:
df

        city  humidity  temperature
0  Hyderabad      25.0         65.0
1  Hyderabad       NaN         22.0
2  Hyderabad      45.0          NaN
3   kakinada      32.0         12.0
4   kakinada       NaN         65.0
5   kakinada      66.0          NaN
6    chennai      31.0         34.0
7      vizag      56.0         77.0
8      vizag      12.0         23.0
9   banglore      34.0         11.0

In [10]:
df_clean

        city  humidity  temperature
0  Hyderabad      25.0         65.0
3   kakinada      32.0         12.0
6    chennai      31.0         34.0
7      vizag      56.0         77.0
8      vizag      12.0         23.0
9   banglore      34.0         11.0

In [18]:
df["humidity"]=df["humidity"].fillna(10)
df

        city  humidity  temperature
0  Hyderabad      25.0         65.0
1  Hyderabad      10.0         22.0
2  Hyderabad      45.0         10.0
3   kakinada      32.0         12.0
4   kakinada      10.0         65.0
5   kakinada      66.0         10.0
6    chennai      31.0         34.0
7      vizag      56.0         77.0
8      vizag      12.0         23.0
9   banglore      34.0         11.0

In [20]:
df["temperature"]=df["temperature"].fillna(df.temperature.mean())
df

        city  humidity  temperature
0  Hyderabad      25.0         65.0
1  Hyderabad      10.0         22.0
2  Hyderabad      45.0         10.0
3   kakinada      32.0         12.0
4   kakinada      10.0         65.0
5   kakinada      66.0         10.0
6    chennai      31.0         34.0
7      vizag      56.0         77.0
8      vizag      12.0         23.0
9   banglore      34.0         11.0

In [24]:
import pandas as pd
df=pd.DataFrame({
    "name":["kaveri","niha","sweety","ramya","prash"],
    "rollno":[3,9,54,52,41]
})
df

     name  rollno
0  kaveri       3
1    niha       9
2  sweety      54
3   ramya      52
4   prash      41